laminar_3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1600;
        startFace       1408400;
    }
    rightWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1600;
        startFace       1410000;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6000;
        startFace       1411600;
    }
    frontandbackWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6000;
        startFace       1417600;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          48000;
        startFace       1423600;
    }
)

// ************************************************************************* //
